In [12]:
import pandas as pd

In [13]:
df=pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# to remove extra header in orignal CSV file(Skipping 1st row)

In [15]:
df=pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# OR  

# Header =1 means Row=2 in CSV as index starts with 0. so it will print from second row

In [9]:
df=pd.read_csv("stock_data.csv",header=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2   RIL  not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

# to add headers when csv files which  dont have header at all

In [10]:
df=pd.read_csv("stock_data.csv",header=None,names = ["ticker","eps","revenue","price","people"])  
df

    ticker            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4      RIL  not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

 # now lets go to Orignal dataframe from stock_data csv file

In [18]:
df=pd.read_csv("stock_data.csv",skiprows=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# to Display only first 3 rows of csv file

In [23]:
df=pd.read_csv("stock_data.csv",nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

# to turn values to NAN values

In [18]:
df=pd.read_csv("stock_data.csv",na_values=["not available","n.a",-1])   # na_values used to maark NaN in csv file 
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65           n.a.
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

 # here we using dictionary for each  column for  NAN settlement

In [25]:
df = pd.read_csv("stock_data.csv",  na_values={                
        'eps': ['not available','n.a.'],
        'revenue': ['not available','n.a.',-1],
        'people': ['not available','n.a.'],
        'price':['not available','n.a.']
    })
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

# now to transfer our data frame to csv file

In [19]:
df.to_csv("new.csv")    # here we are sending our dataframe to csv file with name new_csv (it will craete new file)

# to remove index column in csv file

In [20]:
df.to_csv("new.csv",index=False)

PermissionError: [Errno 13] Permission denied: 'new.csv'

# to display columns in data frame

In [30]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

# to export only 2 (selected)  colums in our new file

In [28]:
df.to_csv("new.csv",index =False,columns=["tickers","eps"]) # now new.csv file hase only 2 columns.